# locales/am.py
MESSAGES = {
    "welcome_lang": "እንኳን ደህና መጡ! እባክዎ ቋንቋዎን ይምረጡ፡",
    "lang_en": "🇬🇧 English",
    "lang_am": "🇪🇹 አማርኛ",
    "select_mode": "ወደ ማርኬትፕሌስ እንኳን ደህና መጡ! እባክዎ ሚናዎን ይምረጡ፡",
    "buyer_btn": "ገዢ 🛒",
    "seller_btn": "ሻጭ 🏭",
    "share_phone": "📱 ስልክ ቁጥር ያጋሩ",
    "share_phone_prompt": "ለመቀጠል እባክዎ ከታች ያለውን በመጫን ስልክ ቁጥርዎን ያጋሩ።",
    "reject_forwarded_contact": "❌ እባክዎ አዝራሩን በመጠቀም የራስዎን ስልክ ቁጥር ብቻ ያጋሩ።",
    "reg_success_buyer": "✅ እንደ ገዢ በተሳካ ሁኔታ ተመዝግበዋል!",
    "seller_bus_name": "የሻጭ ፕሮፋይልዎን እናዘጋጅ።\n🏢 የንግድ ስምዎን ያስገቡ፡",
    "seller_loc": "📍 አድራሻዎን ያስገቡ (ለምሳሌ አዲስ አበባ)፡",
    "seller_cat": "📦 የምርት ዘርፍዎን ያስገቡ (ለምሳሌ ኤሌክትሮኒክስ፣ ግብርና)፡",
    "seller_app_submitted": "📝 ማመልከቻዎ ገብቷል! የአድሚን ማረጋገጫ በመጠባበቅ ላይ። \n/start",
    "new_request": "➕ አዲስ ጥያቄ",
    "language_btn": "🌐 ቋንቋ",
    "switch_mode": "🔄 ሞድ ቀይር",
    #"my_offers": "💰 የኔ ቅናሾች",
    "welcome_back": "እንኳን ደህና መጡ!",
    "pending_admin": "⏳ አካውንትዎ የአድሚን ማረጋገጫ በመጠባበቅ ላይ ነው።\n/start",
    "need_seller_acc": "በመጀመሪያ የሻጭ አካውንት ያስፈልግዎታል።",
    "apply_seller_btn": "ሻጭ ለመሆን ያመልክቱ 🏭",
    "switched_seller": "✅ ወደ ሻጭ ሞድ ተቀይሯል።",
    "switched_buyer": "✅ ወደ ገዢ ሞድ ተቀይሯል።",
    "buyer_send_image": "📸 እባክዎ የሚፈልጉትን ምርት ምስል ይላኩ፡",
    "buyer_enter_qty": "🔢 አሪፍ! አሁን የሚፈልጉትን ብዛት ያስገቡ (ለምሳሌ 5)፡",
    "buyer_invalid_qty": "❌ እባክዎ ትክክለኛ የብዛት ቁጥር ያስገቡ፡",
    "buyer_req_created": "✅ የግዢ ጥያቄዎ ተፈጥሯል እና ለነቁ ሻጮች ተሰራጭቷል!\n/start",
    "req_cancelled": "❌ የጥያቄ ሂደት ተቋርጧል።",
    "help_text": "🛠 *ማርኬትፕሌስ እርዳታ*\n\n/menu - ዋናውን ሜኑ አሳይ\n/language - ቋንቋ ቀይር\n/help - ይህንን መልዕክት አሳይ",
    "enter_full_name": "👤 እባክዎ ሙሉ ስምዎን ያስገቡ፡",
    "seller_shop_num": "🔢 እባክዎ የሱቅ ቁጥርዎን ያስገቡ ምሳሌ(X0-000X) (ከሌለዎት 'N/A' ይበሉ)፡",
    "buyer_rules": (
        "📜 *የፕላትፎርም ደንቦች፡ ለገዢዎች*\n\n"
        "ሀ. ለመግዛት እውነተኛ ፍላጎት ካለዎት ብቻ ጥያቄዎችን ያቅርቡ።\n"
        "ለ. ከምርቱ ጋር የተያያዙ ምስሎችን እና መረጃዎችን ብቻ ይስቀሉ።\n"
        "ሐ. ተደጋጋሚ አላግባብ መጠቀም፣ ስፓም ወይም ቁምነገር የሌላቸው ጥያቄዎች አካውንትዎ እንዲታገድ ሊያደርጉ ይችላሉ።"
    ),
    "seller_rules": (
        "📜 *የፕላትፎርም ደንቦች፡ ለሻጮች*\n\n"
        "ሀ. በትክክል ማቅረብ የሚችሉትን ጥያቄዎች ብቻ ይቀበሉ።\n"
        "ለ. ትክክለኛ ዋጋ እና የምርት መረጃ ያቅርቡ።\n"
        "ሐ. ተቀብለው ለቀረቡ ጥያቄዎች በተደጋጋሚ ምላሽ አለመስጠት ወይም አለማጠናቀቅ አካውንትዎ እንዲታገድ ሊያደርጉ ይችላሉ።"
    ),
    "agree_btn": "ተስማምቻለሁ 👍",
    "seller_approved_mode_switched": "🎉 እንኳን ደስ አለዎት! የሻጭ ፕሮፋይልዎ የጸደቀ ሲሆን፡ አሁን አካውንትዎ በቀጥታ ወደ ሻጭ ሞድ ተቀይሯል።",
}